In [24]:
import pandas as pd

In [25]:
path = 'C:\\Users\\FIC\\Documents\\Rafael-Dias-Python\\arquivos\\'
file = 'bank-full.xlsx'

dados = pd.read_excel(path + file, sheet_name='Sheet 1 - bank-full')

In [26]:
dados

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45211,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45212,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45213,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

In [27]:
media = dados['balance'].mean()

# Ajustando casas decimais
#round(media, 2)

round(media, 0)

1362.0

In [28]:
round(dados[['balance','duration']].mean(),0)

balance     1362.0
duration     258.0
dtype: float64

In [29]:
dados.balance.sum()

61598595

In [30]:
dados[['pdays','duration','balance']].sum()

pdays        1817948
duration    11672894
balance     61598595
dtype: int64

In [31]:
dados.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [32]:
##elementos unicos
dados.job.nunique()

12

In [33]:
##dados duplicados em uma coluna
dados.job.duplicated().sum()

45202

In [34]:
##dados duplicados em uma coluna (verifica se tem registro duplicado no dataframe)
dados.duplicated().sum()

3

In [35]:
dados.loc[dados.duplicated()==True]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
45211,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45212,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45213,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other